bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3U.xml
                    <instance name="ADCB">
                        <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
                        <signals>
                            <signal function="ADC" group="ADC" index="0" pad="PB0"/>
                            <signal function="ADC" group="ADC" index="1" pad="PB1"/>
                            <signal function="ADC" group="ADC" index="2" pad="PB2"/>
                            <signal function="ADC" group="ADC" index="3" pad="PB3"/>
                            <signal function="ADC" group="ADC" index="4" pad="PB4"/>
                            <signal function="ADC" group="ADC" index="5" pad="PB5"/>
                            <signal function="ADC" group="ADC" index="6" pad="PB6"/>
                            <signal function="ADC" group="ADC" index="7" pad="PB7"/>
                            <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                            <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                        </signals>
                    </instance>
                </module>
                <module name="DAC" id="I6059" version="XMEGAAU">
                    <instance name="DACB">
                        <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
                        <signals>
                            <signal function="DAC" group="DAC" index="0" pad="PB2"/>
                            <signal function="DAC" group="DAC" index="1" pad="PB3"/>
                            <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                            <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                        </signals>
                    </instance>
                </module>
                <module name="AC" id="I6077" version="XMEGAAU">
                    <instance name="ACA">
                        <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
                        <signals>
                            <signal function="AC" group="AC" index="0" pad="PA0"/>
                            <signal function="AC" group="AC" index="1" pad="PA1"/>
                            <signal function="AC" group="AC" index="2" pad="PA2"/>
                            <signal function="AC" group="AC" index="3" pad="PA3"/>
                            <signal function="AC" group="AC" index="4" pad="PA4"/>
                            <signal function="AC" group="AC" index="5" pad="PA5"/>
                            <signal function="AC" group="AC" index="6" pad="PA6"/>
                            <signal function="AC" group="AC" index="7" pad="PA7"/>
                            <signal function="ACOUT" group="ACOUT" index="1" pad="PA6"/>
                            <signal function="ACOUT" group="ACOUT" index="0" pad="PA7"/>
                        </signals>
                    </instance>
                    <instance name="ACB">
                        <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
                        <signals>
                            <signal function="AC" group="AC" index="0" pad="PB0"/>
                            <signal function="AC" group="AC" index="1" pad="PB1"/>
                            <signal function="AC" group="AC" index="2" pad="PB2"/>
                            <signal function="AC" group="AC" index="3" pad="PB3"/>
                            <signal function="AC" group="AC" index="4" pad="PB4"/>
                            <signal function="AC" group="AC" index="5" pad="PB5"/>
                            <signal function="AC" group="AC" index="6" pad="PB6"/>
                            <signal function="AC" group="AC" index="7" pad="PB7"/>
                            <signal function="ACOUT" group="ACOUT" index="1" pad="PB6"/>
                            <signal function="ACOUT" group="ACOUT" index="0" pad="PB7"/>
                        </signals>
                    </instance>
                </module>
                <module name="RTC" id="I6093">
                    <instance name="RTC">
                        <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
                    </instance>
                </module>
                <module name="TWI" id="I6089" version="XMEGAAU">
                    <instance name="TWIC">
                        <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                        <signals>
                            <signal function="TWI" group="SDA" pad="PC0"/>
                            <signal function="TWI" group="SCL" pad="PC1"/>
                            <signal function="TWI_EXT" group="SDAIN" pad="PC0"/>
                            <signal function="TWI_EXT" group="SCLIN" pad="PC1"/>
                            <signal function="TWI_EXT" group="SDAOUT" pad="PC2"/>
                            <signal function="TWI_EXT" group="SCLOUT" pad="PC3"/>
                        </signals>
                    </instance>
                    <instance name="TWIE">
                        <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
                        <signals>
                            <signal function="TWI" group="SDA" pad="PE0"/>
                            <signal function="TWI" group="SCL" pad="PE1"/>
                            <signal function="TWI_EXT" group="SDAIN" pad="PE0"/>
                            <signal function="TWI_EXT" group="SCLIN" pad="PE1"/>
                            <signal function="TWI_EXT" group="SDAOUT" pad="PE2"/>
                            <signal function="TWI_EXT" group="SCLOUT" pad="PE3"/>
                        </signals>
                    </instance>
                </module>
                <module name="USB" id="I3005" version="XMEGAAU">
                    <instance name="USB">
                        <register-group address-space="data" offset="0x4C0" name-in-module="USB" name="USB"/>
                        <signals>
                            <signal function="USB" group="DN" pad="PD6"/>
                            <signal function="USB" group="DP" pad="PD7"/>
                        </signals>
                    </instance>
                </module>
                <module name="PORT" id="I6075" version="XMEGAAU">
                    <instance name="PORTA">
                        <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
                        <signals>
                            <signal function="PORTA" group="P" index="0" pad="PA0"/>
                            <signal function="PORTA" group="P" index="1" pad="PA1"/>
                            <signal function="PORTA" group="P" index="2" pad="PA2"/>
                            <signal function="PORTA" group="P" index="3" pad="PA3"/>
                            <signal function="PORTA" group="P" index="4" pad="PA4"/>
                            <signal function="PORTA" group="P" index="5" pad="PA5"/>
                            <signal function="PORTA" group="P" index="6" pad="PA6"/>
                            <signal function="PORTA" group="P" index="7" pad="PA7"/>
                        </signals>
                    </instance>
                    <instance name="PORTB">
                        <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                        <signals>
                            <signal function="PORTB" group="P" index="0" pad="PB0"/>
                            <signal function="PORTB" group="P" index="1" pad="PB1"/>
                            <signal function="PORTB" group="P" index="2" pad="PB2"/>
                            <signal function="PORTB" group="P" index="3" pad="PB3"/>
                            <signal function="PORTB" group="P" index="4" pad="PB4"/>
                            <signal function="PORTB" group="P" index="5" pad="PB5"/>
                            <signal function="PORTB" group="P" index="6" pad="PB6"/>
                            <signal function="PORTB" group="P" index="7" pad="PB7"/>
                        </signals>
                    </instance>
