bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3U.xml
                <register caption="Power Reduction Port F" name="PRPF" offset="0x06" size="1">
                    <bitfield caption="Port F Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port F USART1" mask="0x20" name="USART1"/>
                    <bitfield caption="Port F USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port F SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port F AWEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port F Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port F Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
            </register-group>
        </module>
        <module name="SLEEP" id="I6081" version="XMEGAAU" caption="Sleep Controller">
            <register-group caption="Sleep Controller" name="SLEEP" size="1">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Sleep Mode" mask="0x0E" name="SMODE" values="SLEEP_SMODE"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SEN"/>
                </register>
            </register-group>
            <value-group caption="Sleep Mode" name="SLEEP_SMODE">
                <value caption="Idle mode" name="IDLE" value="0x00"/>
                <value caption="Power-down Mode" name="PDOWN" value="0x02"/>
                <value caption="Power-save Mode" name="PSAVE" value="0x03"/>
                <value caption="Standby Mode" name="STDBY" value="0x06"/>
                <value caption="Extended Standby Mode" name="ESTDBY" value="0x07"/>
            </value-group>
        </module>
        <module name="OSC" id="I6079" version="XMEGAAU" caption="Oscillator">
            <register-group caption="Oscillator" name="OSC" size="7">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="PLL Enable" mask="0x10" name="PLLEN"/>
                    <bitfield caption="External Oscillator Enable" mask="0x08" name="XOSCEN"/>
                    <bitfield caption="Internal 32.768 kHz RC Oscillator Enable" mask="0x04" name="RC32KEN"/>
                    <bitfield caption="Internal 32 MHz RC Oscillator Enable" mask="0x02" name="RC32MEN"/>
                    <bitfield caption="Internal 2 MHz RC Oscillator Enable" mask="0x01" name="RC2MEN"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="PLL Ready" mask="0x10" name="PLLRDY"/>
                    <bitfield caption="External Oscillator Ready" mask="0x08" name="XOSCRDY"/>
                    <bitfield caption="Internal 32.768 kHz RC Oscillator Ready" mask="0x04" name="RC32KRDY"/>
                    <bitfield caption="Internal 32 MHz RC Oscillator Ready" mask="0x02" name="RC32MRDY"/>
                    <bitfield caption="Internal 2 MHz RC Oscillator Ready" mask="0x01" name="RC2MRDY"/>
                </register>
                <register caption="External Oscillator Control Register" name="XOSCCTRL" offset="0x02" size="1">
                    <bitfield caption="Frequency Range" mask="0xC0" name="FRQRANGE" values="OSC_FRQRANGE"/>
                    <bitfield caption="32.768 kHz XTAL OSC Low-power Mode" mask="0x20" name="X32KLPM"/>
                    <bitfield caption="16 MHz Crystal Oscillator High Power mode" mask="0x10" name="XOSCPWR"/>
                    <bitfield caption="External Oscillator Selection and Startup Time" mask="0x0F" name="XOSCSEL"
                              values="OSC_XOSCSEL"/>
                </register>
                <register caption="Oscillator Failure Detection Register" name="XOSCFAIL" offset="0x03" size="1">
                    <bitfield caption="PLL Failure Detection Interrupt Flag" mask="0x08" name="PLLFDIF"/>
                    <bitfield caption="PLL Failure Detection Enable" mask="0x04" name="PLLFDEN"/>
                    <bitfield caption="XOSC Failure Detection Interrupt Flag" mask="0x02" name="XOSCFDIF"/>
                    <bitfield caption="XOSC Failure Detection Enable" mask="0x01" name="XOSCFDEN"/>
                </register>
                <register caption="32.768 kHz Internal Oscillator Calibration Register" name="RC32KCAL" offset="0x04"
                          size="1"/>
                <register caption="PLL Control Register" name="PLLCTRL" offset="0x05" size="1">
                    <bitfield caption="Clock Source" mask="0xC0" name="PLLSRC" values="OSC_PLLSRC"/>
                    <bitfield caption="Divide by 2" mask="0x20" name="PLLDIV"/>
                    <bitfield caption="Multiplication Factor" mask="0x1F" name="PLLFAC"/>
                </register>
                <register caption="DFLL Control Register" name="DFLLCTRL" offset="0x06" size="1">
                    <bitfield caption="32 MHz DFLL Calibration Reference" mask="0x06" name="RC32MCREF"
                              values="OSC_RC32MCREF"/>
                    <bitfield caption="2 MHz DFLL Calibration Reference" mask="0x01" name="RC2MCREF"
                              values="OSC_RC2MCREF"/>
                </register>
            </register-group>
            <value-group caption="Oscillator Frequency Range" name="OSC_FRQRANGE">
                <value caption="0.4 - 2 MHz" name="04TO2" value="0x00"/>
                <value caption="2 - 9 MHz" name="2TO9" value="0x01"/>
                <value caption="9 - 12 MHz" name="9TO12" value="0x02"/>
                <value caption="12 - 16 MHz" name="12TO16" value="0x03"/>
            </value-group>
            <value-group caption="External Oscillator Selection and Startup Time" name="OSC_XOSCSEL">
                <value caption="External Clock - 6 CLK" name="EXTCLK" value="0x00"/>
                <value caption="32.768 kHz TOSC - 32K CLK" name="32KHz" value="0x02"/>
                <value caption="0.4-16 MHz XTAL - 256 CLK" name="XTAL_256CLK" value="0x03"/>
                <value caption="0.4-16 MHz XTAL - 1K CLK" name="XTAL_1KCLK" value="0x07"/>
                <value caption="0.4-16 MHz XTAL - 16K CLK" name="XTAL_16KCLK" value="0x0B"/>
            </value-group>
            <value-group caption="PLL Clock Source" name="OSC_PLLSRC">
                <value caption="Internal 2 MHz RC Oscillator" name="RC2M" value="0x00"/>
                <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x02"/>
                <value caption="External Oscillator" name="XOSC" value="0x03"/>
            </value-group>
            <value-group caption="2 MHz DFLL Calibration Reference" name="OSC_RC2MCREF">
                <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x00"/>
                <value caption="External 32.768 kHz Crystal Oscillator" name="XOSC32K" value="0x01"/>
            </value-group>
            <value-group caption="32 MHz DFLL Calibration Reference" name="OSC_RC32MCREF">
                <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x00"/>
                <value caption="External 32.768 kHz Crystal Oscillator" name="XOSC32K" value="0x01"/>
                <value caption="USB Start of Frame" name="USBSOF" value="0x02"/>
            </value-group>
            <interrupt-group name="OSC">
                <interrupt index="0" name="OSCF" caption="Oscillator Failure Interrupt (NMI)"/>
            </interrupt-group>
        </module>
        <module name="DFLL" id="I6055" version="XMEGAAU" caption="DFLL">
            <register-group caption="DFLL" name="DFLL" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="DFLL Enable" mask="0x01" name="ENABLE"/>
                </register>
