bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3U.xml
                <register caption="Analog Comparator 1 MUX Control" name="AC1MUXCTRL" offset="0x03" size="1">
                    <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
                    <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
                </register>
                <register caption="Control Register A" name="CTRLA" offset="0x04" size="1">
                    <bitfield caption="Analog Comparator 1 Output Enable" mask="0x02" name="AC1OUT"/>
                    <bitfield caption="Analog Comparator 0 Output Enable" mask="0x01" name="AC0OUT"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x05" size="1">
                    <bitfield caption="VCC Voltage Scaler Factor" mask="0x3F" name="SCALEFAC"/>
                </register>
                <register caption="Window Mode Control" name="WINCTRL" offset="0x06" size="1">
                    <bitfield caption="Window Mode Enable" mask="0x10" name="WEN"/>
                    <bitfield caption="Window Interrupt Mode" mask="0x0C" name="WINTMODE" values="AC_WINTMODE"/>
                    <bitfield caption="Window Interrupt Level" mask="0x03" name="WINTLVL" values="AC_WINTLVL"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x07" size="1">
                    <bitfield caption="Window Mode State" mask="0xC0" name="WSTATE" values="AC_WSTATE"/>
                    <bitfield caption="Analog Comparator 1 State" mask="0x20" name="AC1STATE"/>
                    <bitfield caption="Analog Comparator 0 State" mask="0x10" name="AC0STATE"/>
                    <bitfield caption="Window Mode Interrupt Flag" mask="0x04" name="WIF"/>
                    <bitfield caption="Analog Comparator 1 Interrupt Flag" mask="0x02" name="AC1IF"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Flag" mask="0x01" name="AC0IF"/>
                </register>
                <register caption="Current Source Control" name="CURRCTRL" offset="0x08" size="1">
                    <bitfield caption="Current Source Enable" mask="0x80" name="CURRENT"/>
                    <bitfield caption="Current Mode" mask="0x40" name="CURRMODE"/>
                    <bitfield caption="AC1 Current Source Output Enable" mask="0x02" name="AC1CURR"/>
                    <bitfield caption="AC0 Current Source Output Enable" mask="0x01" name="AC0CURR"/>
                </register>
                <register caption="Current Source Calibration" name="CURRCALIB" offset="0x09" size="1">
                    <bitfield caption="Current Source Calibration" mask="0x0F" name="CALIB"/>
                </register>
            </register-group>
            <value-group caption="Interrupt mode" name="AC_INTMODE">
                <value caption="Interrupt on both edges" name="BOTHEDGES" value="0x00"/>
                <value caption="Interrupt on falling edge" name="FALLING" value="0x02"/>
                <value caption="Interrupt on rising edge" name="RISING" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="AC_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Hysteresis mode selection" name="AC_HYSMODE">
                <value caption="No hysteresis" name="NO" value="0x00"/>
                <value caption="Small hysteresis" name="SMALL" value="0x01"/>
                <value caption="Large hysteresis" name="LARGE" value="0x02"/>
            </value-group>
            <value-group caption="Positive input multiplexer selection" name="AC_MUXPOS">
                <value caption="Pin 0" name="PIN0" value="0x00"/>
                <value caption="Pin 1" name="PIN1" value="0x01"/>
                <value caption="Pin 2" name="PIN2" value="0x02"/>
                <value caption="Pin 3" name="PIN3" value="0x03"/>
                <value caption="Pin 4" name="PIN4" value="0x04"/>
                <value caption="Pin 5" name="PIN5" value="0x05"/>
                <value caption="Pin 6" name="PIN6" value="0x06"/>
                <value caption="DAC output" name="DAC" value="0x07"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection" name="AC_MUXNEG">
                <value caption="Pin 0" name="PIN0" value="0x00"/>
                <value caption="Pin 1" name="PIN1" value="0x01"/>
                <value caption="Pin 3" name="PIN3" value="0x02"/>
                <value caption="Pin 5" name="PIN5" value="0x03"/>
                <value caption="Pin 7" name="PIN7" value="0x04"/>
                <value caption="DAC output" name="DAC" value="0x05"/>
                <value caption="Bandgap Reference" name="BANDGAP" value="0x06"/>
                <value caption="Internal voltage scaler" name="SCALER" value="0x07"/>
            </value-group>
            <value-group caption="Windows interrupt mode" name="AC_WINTMODE">
                <value caption="Interrupt on above window" name="ABOVE" value="0x00"/>
                <value caption="Interrupt on inside window" name="INSIDE" value="0x01"/>
                <value caption="Interrupt on below window" name="BELOW" value="0x02"/>
                <value caption="Interrupt on outside window" name="OUTSIDE" value="0x03"/>
            </value-group>
            <value-group caption="Window interrupt level" name="AC_WINTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low priority" name="LO" value="0x01"/>
                <value caption="Medium priority" name="MED" value="0x02"/>
                <value caption="High priority" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Window mode state" name="AC_WSTATE">
                <value caption="Signal above window" name="ABOVE" value="0x00"/>
                <value caption="Signal inside window" name="INSIDE" value="0x01"/>
                <value caption="Signal below window" name="BELOW" value="0x02"/>
            </value-group>
            <interrupt-group name="AC">
                <interrupt index="0" name="AC0" caption="AC0 Interrupt"/>
                <interrupt index="1" name="AC1" caption="AC1 Interrupt"/>
                <interrupt index="2" name="ACW" caption="ACW Window Mode Interrupt"/>
            </interrupt-group>
        </module>
