bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3U.xml
                <register caption="DACA0 Calibration Byte 1" name="DACA0GAINCAL" offset="0x31" size="1"/>
                <register caption="DACB0 Calibration Byte 0" name="DACB0OFFCAL" offset="0x32" size="1"/>
                <register caption="DACB0 Calibration Byte 1" name="DACB0GAINCAL" offset="0x33" size="1"/>
                <register caption="DACA1 Calibration Byte 0" name="DACA1OFFCAL" offset="0x34" size="1"/>
                <register caption="DACA1 Calibration Byte 1" name="DACA1GAINCAL" offset="0x35" size="1"/>
                <register caption="DACB1 Calibration Byte 0" name="DACB1OFFCAL" offset="0x36" size="1"/>
                <register caption="DACB1 Calibration Byte 1" name="DACB1GAINCAL" offset="0x37" size="1"/>
            </register-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_QFN_64">
            <pin pad="PA3" position="1"/>
            <pin pad="PA4" position="2"/>
            <pin pad="PA5" position="3"/>
            <pin pad="PA6" position="4"/>
            <pin pad="PA7" position="5"/>
            <pin pad="PB0" position="6"/>
            <pin pad="PB1" position="7"/>
            <pin pad="PB2" position="8"/>
            <pin pad="PB3" position="9"/>
            <pin pad="PB4" position="10"/>
            <pin pad="PB5" position="11"/>
            <pin pad="PB6" position="12"/>
            <pin pad="PB7" position="13"/>
            <pin pad="GND" position="14"/>
            <pin pad="VCC" position="15"/>
            <pin pad="PC0" position="16"/>
            <pin pad="PC1" position="17"/>
            <pin pad="PC2" position="18"/>
            <pin pad="PC3" position="19"/>
            <pin pad="PC4" position="20"/>
            <pin pad="PC5" position="21"/>
            <pin pad="PC6" position="22"/>
            <pin pad="PC7" position="23"/>
            <pin pad="GND" position="24"/>
            <pin pad="VCC" position="25"/>
            <pin pad="PD0" position="26"/>
            <pin pad="PD1" position="27"/>
            <pin pad="PD2" position="28"/>
            <pin pad="PD3" position="29"/>
            <pin pad="PD4" position="30"/>
            <pin pad="PD5" position="31"/>
            <pin pad="PD6" position="32"/>
            <pin pad="PD7" position="33"/>
            <pin pad="GND" position="34"/>
            <pin pad="VCC" position="35"/>
            <pin pad="PE0" position="36"/>
            <pin pad="PE1" position="37"/>
            <pin pad="PE2" position="38"/>
            <pin pad="PE3" position="39"/>
            <pin pad="PE4" position="40"/>
            <pin pad="PE5" position="41"/>
            <pin pad="PE6" position="42"/>
            <pin pad="PE7" position="43"/>
            <pin pad="GND" position="44"/>
            <pin pad="VCC" position="45"/>
            <pin pad="PF0" position="46"/>
            <pin pad="PF1" position="47"/>
            <pin pad="PF2" position="48"/>
            <pin pad="PF3" position="49"/>
            <pin pad="PF4" position="50"/>
            <pin pad="PF5" position="51"/>
            <pin pad="GND" position="52"/>
            <pin pad="VCC" position="53"/>
            <pin pad="PF6" position="54"/>
            <pin pad="PF7" position="55"/>
            <pin pad="PDI" position="56"/>
            <pin pad="RESET" position="57"/>
            <pin pad="PR0" position="58"/>
            <pin pad="PR1" position="59"/>
            <pin pad="GND" position="60"/>
            <pin pad="AVCC" position="61"/>
            <pin pad="PA0" position="62"/>
            <pin pad="PA1" position="63"/>
            <pin pad="PA2" position="64"/>
        </pinout>
    </pinouts>
</part-description-file>